INSERT INTO t_productAttribute (name, unit, data_type)
VALUES
-- 4 базовые характеристики
('Длина упаковки', 'см', 'NUMBER'),
('Ширина упаковки', 'см', 'NUMBER'),
('Высота упаковки', 'см', 'NUMBER'),
('Срок годности', 'дней', 'NUMBER'),

-- Уникальные характеристики (по 2 на каждый товар)
('Жирность молока МЛК-REG', '%', 'NUMBER'),
('Объем молока МЛК-REG', 'л', 'NUMBER'),
('Жирность молока МЛК-REF', '%', 'NUMBER'),
('Объем молока МЛК-REF', 'л', 'NUMBER'),

('Выдержка сыра СЫР-REG', 'мес', 'NUMBER'),
('Тип сыра СЫР-REG', NULL, 'TEXT'),
('Выдержка сыра СЫР-REF', 'мес', 'NUMBER'),
('Тип сыра СЫР-REF', NULL, 'TEXT'),

('Категория говядины ГВД-REG', NULL, 'TEXT'),
('Вес куска говядины ГВД-REG', 'кг', 'NUMBER'),
('Категория говядины ГВД-REF', NULL, 'TEXT'),
('Вес куска говядины ГВД-REF', 'кг', 'NUMBER'),

('Тип разделки курицы КРЦ-REG', NULL, 'TEXT'),
('Вес упаковки курицы КРЦ-REG', 'кг', 'NUMBER'),
('Тип разделки курицы КРЦ-REF', NULL, 'TEXT'),
('Вес упаковки курицы КРЦ-REF', 'кг', 'NUMBER'),

('Сорт яблок ЯБЛ-REG', NULL, 'TEXT'),
('Калибр яблок ЯБЛ-REG', 'мм', 'NUMBER'),
('Сорт яблок ЯБЛ-REF', NULL, 'TEXT'),
('Калибр яблок ЯБЛ-REF', 'мм', 'NUMBER'),

('Тип огурцов ОГУ-REG', NULL, 'TEXT'),
('Длина огурца ОГУ-REG', 'см', 'NUMBER'),
('Тип огурцов ОГУ-REF', NULL, 'TEXT'),
('Длина огурца ОГУ-REF', 'см', 'NUMBER');
