INSERT INTO t_product_attribute (name, unit, data_type)
VALUES
-- 4 базовые характеристики
('Длина упаковки', 'см', 'NUMBER'),
('Ширина упаковки', 'см', 'NUMBER'),
('Высота упаковки', 'см', 'NUMBER'),
('Срок годности', 'дней', 'NUMBER'),

-- Уникальные характеристики категорий (по 2 на категорию)
('Жирность молока', '%', 'NUMBER'),
('Объем молока', 'л', 'NUMBER'),

('Выдержка сыра', 'мес', 'NUMBER'),
('Тип сыра', NULL, 'TEXT'),

('Категория говядины', NULL, 'TEXT'),
('Вес куска говядины', 'кг', 'NUMBER'),

('Тип разделки курицы', NULL, 'TEXT'),
('Вес упаковки курицы', 'кг', 'NUMBER'),

('Сорт яблок', NULL, 'TEXT'),
('Калибр яблок', 'мм', 'NUMBER'),

('Тип огурцов', NULL, 'TEXT'),
('Длина огурца', 'см', 'NUMBER');
