INSERT INTO t_supplier (
    name,
    contact_info,
    address,
    inn,
    kpp,
    ogrn,
    payment_account,
    bik,
    bank,
    director_last_name,
    director_first_name,
    director_patronymic_name
)
VALUES
('ООО "МилкТрейд"', 'Отдел продаж: +375295000001, milktrade@example.by', 'г. Минск, ул. Молочная, 1', '7712000001', '771201001', '1027712000001', '40702810000000000001', '044525225', 'ОАО "Белбанк"', 'Смирнов', 'Игорь', 'Павлович'),
('ООО "МитСнаб"', 'Отдел логистики: +375295000002, meatsnab@example.by', 'г. Минск, ул. Мясная, 2', '7712000002', '771201002', '1027712000002', '40702810000000000002', '044525225', 'ОАО "Белбанк"', 'Егоров', 'Роман', 'Сергеевич'),
('ООО "ФрутЛайн"', 'Менеджер: +375295000003, fruitline@example.by', 'г. Минск, ул. Фруктовая, 3', '7712000003', '771201003', '1027712000003', '40702810000000000003', '044525225', 'ОАО "Белбанк"', 'Поляков', 'Андрей', 'Ильич'),
('ООО "АгроПоставка"', 'Коммерческий отдел: +375295000004, agro@example.by', 'г. Минск, ул. Полевая, 4', '7712000004', '771201004', '1027712000004', '40702810000000000004', '044525225', 'ОАО "Белбанк"', 'Морозов', 'Евгений', 'Александрович');
